<template>
    <v-layout class="rounded bg-image rounded-md">
        <v-app-bar :order="order" color="black">
            <template v-slot:prepend>
                <img
                    @click="canSee = ''"
                    src="../assets/eideas-logo-vector.svg"
                    width="100"
                    height="40"
                    alt=""
                />
            </template>
            <RouterLink
                v-if="$vuetify.display.mdAndUp"
                class="headerLinks mx-2 headerLinksDiv"
                to="/login"
                style="text-decoration: none"
            >
                შესვლა
            </RouterLink>
            <RouterLink
                v-if="$vuetify.display.mdAndUp"
                class="headerLinks mx-2 headerLinksDiv"
                to="/registration"
                style="text-decoration: none"
            >
                რეგისტრაცია
            </RouterLink>
            <v-app-bar-nav-icon
                v-if="$vuetify.display.smAndDown"
                variant="text"
                color="red"
                @click.stop="drawer = !drawer"
            ></v-app-bar-nav-icon>
        </v-app-bar>
        <v-navigation-drawer
            v-if="$vuetify.display.smAndDown"
            v-model="drawer"
            location="right"
            temporary="true"
            color="black"
        >
            <v-list class="pa-2">
                <div style="width: 100%" class="headerLinksDiv my-2">
                    <RouterLink
                        class="headerLinks"
                        to="/login"
                        style="text-decoration: none"
                    >
                        შესვლა
                    </RouterLink>
                </div>
                <div style="width: 100%" class="headerLinksDiv">
                    <RouterLink
                        class="headerLinks"
                        to="/registration"
                        style="text-decoration: none"
                    >
                        რეგისტრაცია
                    </RouterLink>
                </div>
            </v-list>
        </v-navigation-drawer>

        <v-container
            :class="{
                'pa-1': $vuetify.display.xs,
            }"
            class="d-md-flex h-screen justify-md-space-between"
        >
            <v-main class="" style="max-height: 100%">
                <v-card
                    v-if="canSee === 'contact'"
                    style="background-color: rgba(0, 0, 0, 0.3); color: white"
                >
                    <div class="ma-4">
                        <h1>კონტაქტი</h1>
                        <div class="mt-2">
                            ზღვის უბანი, XI მ/რ, I კვარტალი, II კორპუსი
                        </div>
                        <div class="mt-2">
                            <v-icon>mdi-phone</v-icon>
                            ტელეფონი: +995 322 111 838
                        </div>
                        <div class="mt-2">
                            <v-icon>mdi-mail</v-icon>
                            ელ.ფოსტა: info@eideas.io
                        </div>
                    </div>
                </v-card>
                <v-footer
                    style="background-color: rgba(0, 0, 0, 0.6)"
                    class="text-white mt-2"
                    :app="canSee !== 'privacy'"
                >
                    <div
                        class="pa-4 d-sm-flex justify-space-between align-center"
                        style="width: 100%"
                    >
                        <div>
                            <div class="headerLinksDiv" @click="dialog = true">
                                <h3
                                    class="headerLinks2"
                                    style="
                                        text-decoration: none;
                                        cursor: pointer;
                                        color: white;
                                    "
                                    to=""
                                >
                                    სერვისის წესები და პირობები
                                </h3>
                            </div>
                            <div
                                class="headerLinksDiv mt-2"
                                @click="confidenceDialog = true"
                            >
                                <h3
                                    class="headerLinks2"
                                    style="
                                        text-decoration: none;
                                        cursor: pointer;
                                        color: white;
                                    "
                                    to=""
                                >
                                    კონფიდენციალურობის პოლიტიკა
                                </h3>
                            </div>
                        </div>
                        <div>
                            <b>კონტაქტი</b>
                            <div>
                                ზღვის უბანი, XI მ/რ, I კვარტალი, II კორპუსი
                            </div>
                            <div>
                                <v-icon>mdi-phone</v-icon>
                                ტელეფონი: +995 322 111 838
                            </div>
                            <div>
                                <v-icon>mdi-mail</v-icon>
                                ელ.ფოსტა: info@eideas.io
                            </div>
                        </div>
                    </div>
                </v-footer>
            </v-main>
        </v-container>
    </v-layout>
    <v-dialog
        v-model="dialog"
        fullscreen
        :scrim="false"
        transition="dialog-bottom-transition"
    >
        <v-card>
            <v-toolbar dark color="black">
                <v-btn icon dark style="color: red" @click="dialog = false">
                    <v-icon>mdi-close</v-icon>
                </v-btn>
                <v-toolbar-title style="color: red"
                    >სერვისის წესები და პირობები</v-toolbar-title
                >
                <v-spacer></v-spacer>
            </v-toolbar>
            <v-card-text>
                <h1>სერვისის პირობები და წესები</h1>
                <p>
                    მომხმარებლები, რომლებიც ისარგებლებენ ჩვენი მომსახურებით,
                    ვალდებულნი არიან დაეთანხმონ ჩვენი სერვისის პირობებსა და
                    წესებს და დაიცვან ისინი. ვიტოვებთ უფლებას ცალმხრივად
                    შევიტანოთ ცვლილებები პირობებსა და წესებში ნებისმიერ დროს.
                </p>
                <p>
                    ქვემოთ აღწერილი წესებით რეგულირდება მომხმარებლის პირადი
                    ანგარიშის შექმნა/დახურვა და გამოყენება/სარგებლობა ჩვენს
                    ვებ–გვერდზე. ეს პირობები კონფიდენციალურობის პოლიტიკასთან
                    ერთად, წარმოადგენს ჩვენს სამართლებრივ ურთიერთობას
                    მომხმარებლებთან.
                </p>
                <p>
                    დამატებითი სერვისების გამოყენებისთვის, მომხმარებლებს
                    შესაძლოა მოუწიოთ დამატებითი წესებისა და პირობების მიღება
                    დათანხმობა, ამგვარი სერვისებით სარგებლობისას.
                </p>
                <p>
                    მომხმარებელს ნებისმიერ დროს აქვს შესაძლებლობა იხილოს
                    სერვისით სარგებლობის განახლებული პირობები და წესები ვებ
                    გვერდზე: https://168.119.179.190/ სერვისის პირობებსა
                    დაწესებზე დათანხმებით, მომხმარებელი ასევე ეთანხმება
                    კონფიდენციალურობის პოლიტიკასაც.
                </p>
                <h3>1. მომხმარებლის ანგარიში</h3>
                <p>
                    1.1 მომხმარებლის ანგარიში არის ანგარიში, რომელიც
                    საცხოვრებელი კორპუსის ლიფტისა და დომოფონის მომსახურების
                    საფასურის გადახდის საშუალებას იძლევა.
                </p>
                <p>
                    1.2 მომხმარებლის ანგარიშზე არსებული ბალანსის გამოყენების
                    ვადა არ არის შეზღუდული.
                </p>
                <p>
                    1.3 მომხმარებლის ანგარიშზე არსებული ბალანსის ანგარიში არ
                    არის საბანკო ანგარიში.
                </p>
                <p>
                    1.4 მომხმარებლის ანგარიშზე არსეუბლი ბალანსი ეკუთვნის იმ
                    ფიზიკურ პირს, რომელიც დარეგისტრირდა, როგორც მომხმარებლის
                    ანგარიშის მფლობელი.
                </p>
                <h3>2. მომხმარებლის ანგარიშის შექმნა (რეგისტრაცია).</h3>
                <p>
                    2.1 ჩვენი სერვისით სარგებლობისთვის, აუცილებელია რეგისტრაციის
                    გავლა ჩვენს ვებ–გვერდზე: https://168.119.179.190/
                    რეგისტრაციისას მომხმარებელი აუცილებლად უნდა დაეთანხმოს ჩვენი
                    სერვისის წესებსა და პირობებს და ასევე კონფიდენციალურობის
                    პოლიტიკას.
                </p>
                <p>
                    2.2 დამატებითი სხვა სერვისებით სარგებლობისთვის, მომხმარებელს
                    შესაძლოა დასჭირდეს დამატებით წესებსა და პირობებზე
                    დათანხმება.
                </p>
                <p>
                    2.3 შესაძლებელია რამდენიმე მომხმარებლის ანგარიშის შექმნა და
                    მომხმარებლის ანგარიშზე ბარათების მიბმა.
                </p>
                <p>
                    2.4 მომხმარებლის მიერ მოწოდებული ყველა ინფორმაცია უნდა იყოს
                    ზუსტი, სწორი და მოქმედი, როგორც რეგისტრაციისას, ისე
                    შემდგომში ნებისმიერ დროს.
                </p>
                <p>
                    2.5 სერვისის წესებსა და პირობებზე თანხმობით მომხმარებელი
                    ასევე აცხადებს თანხმობას, თავისი პირადი მონაცემების
                    გადაცემა/გამოთხოვა/მიღებას იმ ფიზიკური/იურიდიული პირებისგან,
                    რომლებთანაც ინფორმაციის მიმოცვლაც საქართველოს კანონმდებლობით
                    არის დაშვებული.
                </p>
                <h3>3. მომხმარებლის ანგარიშის შენახვა</h3>
                <p>
                    3.1 მომხმარებელი უნდა დარწმუნდეს, რომ თავის ანგარიშზე
                    განთავსებული ინფორმაცია ყოველთვის ზუსტი და განახლებულია.
                    ჩვენ არ ვართ პასუხისმგებლები მომხმარებლის მიერ
                    რეგისტრაციისას ან შემდგომში მოწოდებული ინფორმაციის სიმცდარით
                    გამოწვეულ ზარალზე.
                </p>
                <p>
                    3.2 ჩვენ ნებისმიერ დროს გვაქვს უფლება მივმართოთ მომხმარებელს
                    ინფორმაციის სიზუსტის დადასტურების მოთხოვნით.
                </p>
                <p>
                    3.3 მომხმარებელთან კომუნიკაციისთვის ვისარგებლებთ ელექტრონული
                    ფოსტით , მოკლე ტექსტური შეტყობინებით ან სატელეფონო ზარით
                    იმისათვის, რომ მივაწოდოთ ინფორმაცია თვისი ანგარიშის შესახებ.
                </p>
                <p>
                    3.4 მომხმარებელი ვალდებულია რეგულარულად შეამოწმოს იმ
                    საკომუნიკაციო საშუალებების ფუნქციონირება, რომლებიც მიუთითა
                    ვებგვერდზე რეგისტრაციისას შესაბამის ველებში. ასევე
                    ვალდებულია დროულად მოიძიოს და გაეცნოს თვის ანგარიშთან
                    დაკავშირებულ შეტყობინებებს.
                </p>
                <p>
                    3.5 ჩვენ პასუხს არ ვაგებთ მომხმარებლის მიერ აღნიშნული
                    მოთხოვნის შეუსრულებლობით გამოწვეულ ზიანზე.
                </p>
                <p>
                    3.6 მომხმარებლის ბალანსის შევსება და გადახდები აისახება
                    ტრანზაქციების ისტორიაში.
                </p>
                <p>
                    3.7 მომხმარებელმა რეგულარულად უნდა შეამოწმოს ბალანსი და
                    ტრანზაქციების ისტორია. ნებისმიერი დარღვევის შესახებ ან
                    რომელიმე საკითხის გარკვევის მიზნით, დაუყოვნებლივ უნდა
                    დაგვიკავშირდეთ.
                </p>
                <h3>4. მომხმარებლის ანგარიშის უსაფრთხოება.</h3>
                <p>
                    4.1 მომხმარებელმა ანგარიშის პაროლი უნდა შეინახოს უსაფრთხოდ
                    და არ მიაწოდოს სხვა პირს.
                </p>
                <p>
                    4.2 ჩვენ მომხმარებელს არ მოვთხოვთ პაროლის ჩვენთვის ან სხვა
                    პირისთვის მიწოდებას.
                </p>
                <p>
                    4.3 თუ მომხმარებელი მიიღებს საეჭვო შეტყობინებას ან აღმოაჩნს
                    ჩვენს, სავარაუდოდ, ყალბ ვებ–გვერდს, ვალდებულია
                    დაგვიკავშირდეს დაუყოვნებლივ. არ სცადოს საეჭვო ვებ გვერდების
                    გამოყენება ან შეტყობინებებზე გამოხმაურება. ჩვენ არ ვაგებთ
                    პასუხს მომხმარებლის მიერ აღნიშნული პირობის შეუსრულებლობით
                    მიყენებულ ზიანზე.
                </p>
                <p>
                    4.4 მომხმარებელმა არ უნდა დართოს სხვა პირს თავის ანგარიშზე
                    შესვლის ნება და/ან დაუშვას, რომ ვინმემ თვალი ადევნოს
                    ანგარიშზე შესვლის პროცესს. მომხმარებელმა არ უნდა შეარჩიოს
                    ისეთი პაროლი, რომელიც ადვილად გამოცნობადი იქნება იმ
                    ინფორმაციის საფუძველზე, რომელიც სხვა პირისთვის
                    ხელმისაწვდომია ან სხვა პირმა მოიპოვა მომხმარებლის შესახებ;
                </p>
                <p>
                    4.5 თუ მომხმარებელს აქვს ეჭვი, რომ სისტემაში შესასვლელად
                    საჭირო მონაცემები (მაგალითად, პაროლი) არასანქცირებულად
                    გამოიყენეს ან ემუქრება არასნქცირებულად გამოყენების საფრთხე,
                    მან დაუყოვნებლივ უნდა შეცვალოს პაროლი და დაგვიკავშირდეს.
                </p>
                <p>
                    4.6 აღნიშნულის შესახებ, ჩვენთვის შეტყობინების გვიან მოწოდება
                    მომხმარებლის ანგარიშის უსაფრთხოებაზე უარყოფით გავლენას
                    მოახდენს.
                </p>
                <p>
                    4.7 მომხმარებლის ელ. ფოსტის ანგარიში უნდა იყოს დაცული და
                    მხოლოდ მომხმარებლისთვის ხელმისაწვდომი, რადგან არ მოხდეს მისი
                    პაროლის შეცლის ან მომხმარებლის ანგარიშის უსაფრთხოების
                    დარღვევის მიზნით გამოყენება.
                </p>
                <p>
                    4.8 მომხმარებელთა ანგარიშებზე რეგისტრირებულ ელ. ფოსტის
                    მისამართებს რაიმე საფრთხე შეექმნება, მომხმარებელი
                    დაუყოვნებლივ უნდა დაგვიკავშირდეს.
                </p>
                <h3>5. მომხმარებლის ანგარიშის დახურვა</h3>
                <p>
                    5.1 მომხმარებელს შეუძია დახუროს თავისი ანგარიში, ამისათვის
                    საჭიროა დაგვიკავშირდეს.
                </p>
                <p>
                    5.2 თუ ანგარიშის დახურვისას ბალანსზე ისახება თანხა, მისი
                    უკან დაბრუნება არ ხდება, ამიტომ, სასურველია ანგარიშის
                    დახურვისას ბალანსი იყოს უკვე გახარჯული. ასევე მისი გადატანა
                    შესაძლებელია სხვა მომხმარებლის ანგარიშის ბალანსზე, რაც
                    შესაძლებელია ჩვენან დაკავშირებით.
                </p>
                <p>
                    5.3 მომხმარებლის ანგარიშის დახურვის შემდგომ ჩვენ მაინც
                    ვინახავთ მომხმარებლის მონაცემებს და მის მიერ განხორციელებული
                    ტრანზაქციების ისტორიას.
                </p>
                <h3>6. მომხმარებლის ანგარიშის ხელახლა გახსნა</h3>
                <p>
                    6.1 თუ მომხმარებელი მოისურვებს რომ კვლავ გახსნას ანგარიში,
                    ამისთვის საჭიროა დაგვიკავშირდეს ჩვენ.
                </p>
                <h3>7. მომხმარებლის ბალანსის შევსება.</h3>
                <p>
                    7.1 ბალანსის შევსება შესძლებელია ჩვენი ვებ-გვერდიდან ან
                    აპლიკაციიდან ქართული ბანკების პლასტიკური ბარათების
                    გამოყენებით, ან თიბისი ბანკის სწრაფი გადახდის აპარატების
                    მეშვეობით.
                </p>
                <p>
                    7.2 ბალანსის შევსების მეთოდები წარმოადგენს ჩვენგან
                    დამოუკიდებელი ფინანსური ინსტიტუტების მიერ გაწეულ გადახდის
                    მომსახურებებს და არა ჩვენი სერვისის ნაწილს. ამიტომ ჩვენ არ
                    ვიძლევით გარანტიას ბალანსის შევსების რომელიმე მეთოდის
                    გამოყენებაზე და შესაძლოა ნებისმიერ დროს შევცვალოთ ან
                    გავაუქმოთ რომელიმე გადახდის მეთოდი.
                </p>
                <p>
                    7.3 თანხის ჩვენს ანგარიშზე ასახვამდე ჩვენ პასუხისმგებელი არ
                    ვართ ბალანსის შევსების პროცედურაზე.
                </p>
                <p>
                    7.4 ჩვენ წარმოვადგენთ არა გადახდის მომსახურების პროვაიდერს,
                    არამედ გადასახადის მიმღებს.
                </p>
                <h3>8. სერვისის ღირებულიების გადახდა</h3>
                <p>
                    8.1 სერვისის ღირებულების გადახდა ხორციელდება მომხმარებლის
                    ანგარიშზე მიბმული ბარათ(ებ)ის ლიფტებში განთავსებულ
                    წამკითხველ მოწყობილობებზე დაფიქსირებით.
                </p>
                <h3>9. სააბონენტოს საფასური.</h3>
                <p>
                    9.1 სისტემის სააბონენტოს ყოველთვიური საფასურის ოდენობა
                    განისაზღვრება კონკრეტული კორპუსის წარმომადგენელთან
                    (თავმჯდომარესთან) შეთანხმებით.
                </p>
                <h3>10. პასუხისმგებლობა</h3>
                <p>
                    10.1 მომხამრებელთა საყურადღებოდ: გთხოვთ, რეგულარულად და
                    ხშირად შეამოწმოთ ტრანზაქციების ისტორია მომხმარებლის
                    ანგარიშზე და დაუყოვნებლივ დაგვიკავშირდეთ რაიმე შეკითხვების
                    ან პრობლემების არსებობის შემთხვევაში.
                </p>
                <p>
                    10.2 ჩვენ არ ვართ პასუხისმგებელი ისეთ საშუამავლო
                    მომსახურებებთან დაკავშირებულ რაიმე დარღვევაზე ან
                    გაუმართაობაზე, რომელსაც ვეყრდნობით საკუთარი ვალდებულებების
                    შესრულების დროს, იმ პირობით, თუ ამგვარი დარღვევა ან
                    გაუმართაობა გამოწვეულია გაუთვალისწინებელი გარემოებებით, რაც
                    აღემატება ჩვენს კეთილგონივრულ კონტროლს.
                </p>
                <p>
                    10.3 სერვისით სარგებლობის პირობებით გათვალისწინებული
                    ვალდებულება შემოიფარგლება მომხმარებლისთვის ბალანსისა და
                    მასთან დაკავშირებული გადახდის სერვისების უზრუნველყოფით.
                </p>
                <h3>11. მომხმარებლის ანგარიშის შეწყვეტა და შეჩერება.</h3>
                <p>
                    11.1 მომხმარებელს შეუძლია შეწყვიტოს საკუთარი ანგარიში
                    ნებისმიერ დროს ჩვენთან დაკავშირების საშუალებით.
                </p>
                <p>
                    11.2 ჩვენ ნებისმიერ დროს შეგვიძლია შევაჩეროთ მომხმარებლის
                    ანგარიში შეტყობინების გარეშე იმ შემთხვევაში:
                </p>
                <p>
                    თუ მომხამრებელი დაარჭვევს სერვისის რომელიმე პირობას ან
                    კონკრეტული პირობებითა და დებულებებით დარეგულირებულ კონკრეტულ
                    მომსახურებებზე მოქმედ ნებისმიერ სხვა პირობას;
                </p>
                <p>
                    თუ მომხმარებელი დაარღვევს ან ჩვენ გვაქვს მიზეზი ვიფიქროთ,
                    რომ არღვევს ჩვენი სერვისების გამოყენებაზე გავრცელებულ
                    რომელიმე კანონს ან წესს;
                </p>
                <p>
                    თუ გვაქვს იმის მიზეზი, რომ მომხმარებელი ნებისმიერი გზით არის
                    ჩართული რაიმე თაღლითურ ქმედებაში, ფულის გათეთრებაში,
                    ტერორიზმის დაფინანსებაში ან სხვა დანაშაულებრივ საქმიანობაში.
                </p>
                <h3>12. წინამდებარე წესებსა და პირობებში ცვლილებების შეტანა</h3>
                <p>
                    12.1 წინამდებარე წესები და პირობები, ასევე დამატებითი
                    სერვისების მარეგულირებელი ნებისმიერი წესები და პირობები და
                    დებულებები ექვემდებარება ცვლილებებს.
                </p>
                <p>
                    12.2 ნებისმიერი ცვლილება წესებსა და პირობებში ძალაში შედის
                    დაუყონებლივ, გამოქვეყნებისთანავე.
                </p>
                <h3>13. კომუნიკაცია</h3>
                <p>
                    13.1 მომხმარებელთან ძირითად საკონტაქტო ფორმას ჩვენთვის
                    წარმოადგენს მომხმარებლის მიერ მითითებული ელექტრონული ფოსტა.
                </p>
                <p>
                    13.2 მომხმარებელი ვალდებულია გაეცნოს ჩვენს მიერ გამოგზავნილ
                    შეტყობინებებს და შეკითხვების შემთხვევაში დაგვიკავშირდეს
                </p>
                <p>
                    13.2.1ელექტრონული ფოსტით გაგზავნილი შეტყობინებები შესაძლოა
                    შეიცავდეს დამატებით კომუნიკაციაზე ბმულებს ჩვენს ვებ გვერდზე.
                </p>
                <p>13.3 მომხმარებელთან ურთიერთობა წარიმართება ქართულ ენაზე.</p>
                <p>
                    13.4 ელ. ფოსტით კომუნიკაციის გარდა, ჩვენ შესაძლოა
                    მომხმარებელს დავუკავშირდეთ სატელეფონო ზარის ან მოკლე
                    ტექსტური შეტყობინების საშუალებით.
                </p>
                <p>
                    ჩვენთან დაკავშირება შესაძლებლეია ვებ გევრდზე: eideas.io
                    მოცემული საკონტაქტო საშუალებებით.
                </p>
                <h4>14. თანხის დაბრუნება</h4>
                <p>
                    თანხის შეცდომით ჩარიცხვის შემთხვევაში,მომხმარებელი უნდა
                    დაგვიკავშირდეს კომპანიის ელ-ფოსტის მისამართზე:
                    info@eideas.io, მეილში უნდა იყოს აღნიშნული მომხმარებლის
                    საიდენტიფიკაციო ინფორმაცია, გადახდილი თანხის თარიღი და
                    ოდენობა. მიღებული ინფორმაციის გადამოწმების შემდეგ
                    ადმინისტრაცია მიიღებს გადაწყვეტილებას გადახდილი თანხის
                    დაბრუნების შესახებ და პასუხს დააბრუნებს წერილობით ელ-ფოსტის
                    საშუალებით, ან დაუკავშრიდება მომხამრებელს საკონტაქტო
                    ნომერზე.
                </p>
            </v-card-text>
        </v-card>
    </v-dialog>
    <v-dialog
        v-model="confidenceDialog"
        fullscreen
        :scrim="false"
        transition="dialog-bottom-transition"
    >
        <v-card>
            <v-toolbar dark color="black">
                <v-btn
                    icon
                    dark
                    style="color: red"
                    @click="confidenceDialog = false"
                >
                    <v-icon>mdi-close</v-icon>
                </v-btn>
                <v-toolbar-title style="color: red"
                    >კონფიდინციალურობის პოლიტიკა</v-toolbar-title
                >
                <v-spacer></v-spacer>
            </v-toolbar>
            <v-card-text>
                <h1>კონფიდინციალურობის პოლიტიკა</h1>
                <h3>შესავალი</h3>
                <p>
                    ჩვენი ვალდებულებაა მომხმარებლის პირადი მონაცემების დაცვა. ეს
                    პოლიტიკა ასახავს მომხმარებელთა უფლებებს, რომლებიც
                    დაკავშირებულია ჩვენს მიერ მომხმარებელთა პირადი მონაცემების
                    დაცვას, გამოყენებასა და შეგროვებასთან. კონფიდენციალურობის
                    პოლიტიკის და გამოყენების პირობების მიღებითა და დადასტურებით
                    მომხმარებელი თანხმობას გვაძლევს შევაგროვოთ, გამოვიყენოთ და
                    გავავრცელოთ თქვენი პირადი ინფორმაცია კონფიდენციალურობის
                    პოლიტიკაში განსაზღვრული წესით.
                </p>

                <h3>
                    რა ტიპის პერსონალურ ინფორმაციას ვაგროვებთ მომხმარებლის
                    შესახებ?
                </h3>
                <p>
                    როდესაც მომხმარებელი სარგებლობს ჩვენი ვებგვერდით და
                    მომსახურებით, ჩვენ ვაგროვებთ ინფორმაციას მის შესახებ,
                    რომელიც იგზავნება მომხამრებლის კომპიუტერიდან, მობილური
                    ტელეფონიდან ან სხვა მოწყობილობიდან. ჩვენ გვჭირდება
                    მომხმარებლის შესახებ ისეთი პირადი მონაცემები, როგორიცაა
                    სახელი და გვარი, ელექტრონული მისამართი და ტელეფონის ნომერი.
                </p>

                <p>
                    ვინახავთ მომხმარებლის ბრაუზერს და ip მისამართს. ასევე
                    მომხმარებლის მიერ გამოგზავნილ ელექტრონულ შეტყობინებებს.
                    ასევე ჩვენს ვებ–გვერდზე ან აპლიკაციაში შესრულებულ ნებისმიერ
                    ტრანზაქციას და ქუქი ფაილების მიერ შეგროვებულ ინფორმაციას.
                </p>

                <h3>პირადი ინფორმაციის გამოყენება</h3>
                <p>
                    მომხმარებლის პირად ინფორმაციას გამოვიყენებთ მისი ანგარიშის
                    გააქტიურებისა და და ჩვენს მიერ მომსახურებების გაწევითვის.
                </p>

                <p>
                    ჩვენ ასევე შესაძლოა მომხმარებლის პირადი მონაცემები მივაწოდოთ
                    ჩვენს კორპორატიულ ჯგუფში გაერთიანებულ სხვა ისეთ კომპანიებს,
                    რომლებიც ჩართულნი არიან თქვენთვის სერვისების გაწევის
                    პროცესში. მომხმარებელი პირდაპირ ეთანხმება თვისი მონაცემების
                    ამგვარად გამჟღავნებას.
                </p>

                <p>
                    მომხმარებლის მონაცემებს ვიყენებთ იმისთვის რომ: გახსნას
                    ანგარიში ჩვენს სისტემაში, შეავსოს ბალანსი. შეამოწმოს და
                    მართოს საკუთარი ანგარიში, უზრუნველვყოთ დამკვეთის მხარდაჭერა,
                    უსაფრთხო ტრანზაქციების პროცესი , დავების გადაჭრა, გადასახადი
                    აკრება, დავუკავშირდეთ მომხმარებელს ელექტრონულ ფოსტაზე რათა
                    შევამოწმოთ ტრანზაქციების სისწორე და ანგარიშის ავთენტურობა.
                    გავაცნოთ მომხმარებლებს ინფორმაცია ჩვენი პროდუქციისა და
                    მომსახურების შესახებ. დროდადრო ვაცნობოთ მათ მნიშვნელოვანი
                    ცვლილებების შესახებ ვებ–გვერდზე, მომხმარებლის მიერ ჩვენთვის
                    მოწოდებული ინფორმაცია დამუშავდება შევსებული პირადი
                    ინფორმაციის შესაბამისად.
                </p>

                <p>
                    მომხმარებლის ანგარიშის გახსნის მიზნით, მაღალი ღირებულების
                    ტრანზაქციებისთვის ჩვენ შესაძლოა პირადი ინფორმაცია გადავცეთ
                    შესაბამის ორგანოებს. შემოწმების მიზნით, ჩვენი სერვისებით
                    სარგებლობისას, მომხმარებლის IP მისამართის აკრეფისა და
                    სისტემაში შესვლის დროები იწერება და ინახება თაღლითური
                    მოხმარების თავიდან აცილების და ჩვენი სერვისების უსაფრთხოების
                    უზრუნველსაყოფად. ჩვენ შესაძლოა ასევე მოვიპოვოთ გამოყენებისა
                    და წვდომის შესახებ ინფორმაცია, რომელიც საშუალებას მოგვცემს
                    ანგარიშის მრავალჯერადად გახსნის ან სხვა თაღლითური ქმედების
                    თავიდან აცილების ან ჩვენს სისტემებში უკანონო შეჭრისგან ან
                    ბოროტად გამოყენებისგან თავდაცვის მიზნით. მხოლოდ და მხოლოდ ამ
                    მიზნით, ჩვენ შესაძლოა ამგვარი ინფორმაცია გავუზიაროთ
                    თაღლითური ქმედებების მართვის სპეციალიზირებულ და სანდო
                    სამსახურებს, რომლებიც დახმარებას გაგვიწევენ ამ ინფორმაციის
                    გაანალიზებაში.
                </p>

                <h3>რა არის ქუქი ფაილები და როგორ ვიყენებთ მათ?</h3>
                <p>
                    ჩვენ ასევე შესაძლოა გამოვიყენოთ ქუქი-ფაილები . ქუქი არის
                    მოკლე ტექსტური ფაილი, რომელსაც მომხმარებელი მყარ დისკზე
                    ინახავს მის მიერ მონახულებული ვებგვერდი. ტექსტური ფაილი
                    შეიცავს ინფორმაციას და, სხვა მიზნებთან ერთად, გამოიყენება
                    მნახველის მიერ შესაბამისი ვებგვერდით სარგებლობის
                    უზრუნველსაყოფად.
                </p>
                <p>
                    ქუქი-ფაილით მოპოვებული და შენახული ინფორმაცია შესაძლოა
                    შედარდეს ჩვენს სისტემაში მოპოვებულ და შენახულ პირად
                    მონაცემებთან.
                </p>
                <p>
                    ქუქი ფაილები გვეხმარება დავიმახსოვროთ მომხმარებელი. როცა ის
                    შედის ვებგვერდზე ფაილები აქტიურდება, ხოლო როცა ტოვებს მას,
                    ავტომატურად ითიშება. მომხმარებლებს შეუძლიათ არ დაუშვან ქუქი
                    ფაილები თავიანთ კომპიუტერში , თუმცა ამ შემთხვევაში არ
                    ექნებათ შესაძლებლობა მოხვდნენ ჩვენი საიტს ყველა გვერდზე
                    უპრობლემოდ.
                </p>

                <h3>მომხმარებლის პირადი ინფორმაციის კონტროლი</h3>
                <p>
                    თუ მომხმარებლის პირადი მონაცემები (როგორიცაა სახელი და გვარი
                    ან ტელეფონის ნომერი) შეიცვლება, მან დაუყოვნებლივ უნდა
                    განაახლოს მონაცემები მომხმარებლის ანგარიშის ,,პროფილის ”
                    განყოფილებაში ან დაგვიკავშირდეს მეილზე info@eideas.io. ჩვენ
                    პასუხს არ ვაგებთ არცერთ ისეთ ზიანზე, რომელიც წარმოიქმნება
                    მომხმარებლის მიერ პირადი მონაცემების განუახლებლობის შედეგად.
                </p>
                <p>
                    მომხმარებლის ანგარიშის დეაქტივაციისთვის უნდა დაგვივშირდეთ
                    მეილზე info@eideas.io ან დაგვიკავშირდეთ ჩვენი ვებგვერდის
                    eideas.io კონტაქტის გვერდზე მითითებუი საკონტაქტო
                    საშუალებებით. კანონის თანახმად ჩვენ ვალდებულები ვართ
                    შევინახოთ გარკვეული ჩანაწერები თქვენი ანგარიშის დახურვიდან
                    მინიმუმ ხუთი წლის განმავლობაში.
                </p>
                <h3>მომხმარებელთან კომუნიკაცია</h3>
                <p>
                    რეგისტრირებული მომხმარებლები დროდადრო ინფორმაციას მიიღებენ
                    პროდუქტებზე და სერვისებზე საინფორმაციო მეილების საშუალებით,
                    თუ მომხმარებელი არ დააფიქსირებს საკუთარ პოზიციას, რომ მას არ
                    სურს ამგვარი მეილის მიღება. მომხმარებელს შეუძლია ჩვენი
                    საინფორმაციო მეილების მიღებასთან დაკავშირებით საკუთარი
                    პოზიციის შეცვლა დააფიქსიროს ნებისმიერი საინფორმაციო მეილის
                    ელექტრონულ შეტყობინებაზე Replay-ის გაკეთებით ტექსტით:
                    Unsubscribe. გთხოვთ, გაითვალისწინეთ, რომ მომხმარებელი მაინც
                    მიიღებს ისეთ შეტყობინებას მომხმარებლის ანგარიშის შესახებ,
                    როგორიცაა ტრანზაქციებთან დაკავშირებული ელექტრონული
                    შეტყობინებები ან მომხმარებლის ანგარიშის ფუნქციონირებასთან ან
                    ჩვენს სამართლებრივ ურთიერთობასთან დაკავშირებული სხვა
                    შეტყობინებები.
                </p>
                <h3>სხვა ვებ–გვერდების ბმულები</h3>
                <p>
                    ჩვენი ვებგვერდი შეიცავს სხვა ვებ–გვერდების ბმულებს.
                    გაცნობებთ, რომ ჩვენ პასუხს არ ვაგებთ აღნიშნული ვებ–გვერდების
                    კონფიდენციალურობის პოლიტიკაზე.
                </p>
                <p>
                    ჩვენ მომხმარებლებს ვურჩევთ გაეცნონ თითოეული იმ ვებგვერდის
                    კონფიდენციალურობასთან დაკავშირებულ განცხადებებს, სადაც
                    მოხვდებიან ჩვენს ვებგვერდზე არსებულ ბმულებზეზე დაწკაპებით.
                    ხოლო ეს კონკრეტული კონფიდენციალობის პოლიტიკა ვრცელდება
                    მხოლოდ ჩვენს ვებგვერდზე და სერვისებზე.
                </p>
                <h3>მომხმარებლის უსაფრთხოება</h3>
                <p>
                    მომხმარებლის პირადი მონაცემები დაცულია არასანქცირებული
                    წვდომისგან, გამოყენებისგან ან გამჟღავნებისგან. ინტერნეტ
                    კავშირი მომხმარებელსა და პლატფორმას შორის ხდება დაშიფრული
                    SSL/TLS პროტოკოლის გამოყენებით და ავტორიზირებული
                    სერთიფიკატით, რომელიც უსაფრთხოების მაღალი დონის სტანდარტად
                    მიიჩნევა. მომხარებელი, თავისივე უსაფრთხოების დაცვის მიზნით,
                    ვალდებულია დაიცვას უსაფრთხოების წესები, კერძოდ: მან არასოდეს
                    უნდა გაანდოს სხვას საკუთარი მომხმარებლის ანგარიშის დეტალები.
                    თუ მომხმარებელი ვარაუდობს, რომ მისი ანგარიშის რომელიმე
                    დეტალს საფრთხე შეექმნა, შეუძლია შეცვალოს პაროლი ნებისმიერ
                    დროს როგორც კი სისტემაში შევა, თუმცა ასევე დაუყოვნებლივ უნდა
                    დაგვიკავშირდეს მეილზე და გვაცნობოს მიზეზები, თუ რატომ
                    ფიქრობს, რომ მის ანგარიშს საფრთხე ემუქრება.
                </p>
                <h3>შეტყობინება ცვლილებების შესახებ</h3>
                <p>
                    კონფიდენციალურობის პოლიტიკაში ცვლილებები გამოქვეყნდება ჩვენს
                    ვებ–გვერდზე. თუ ჩვენ დავაპირებთ თქვენი პირადი მონაცემების
                    გამოყენებას მათი შეგროვების დროს განსაზღვრული პირობებისგან
                    განსხვავებული გზით, ჩვენ ამას მომხარებელს შევატყობინებთ
                    ელექტრონული ფოსტით. მომხამრებელს უფლება აქვს პროტესტი
                    გამოთქვას თავისი პირადი მონაცემების ნებისმიერი ახალი სახით
                    გამოყენებაზე ჩვენთან დაკავშირებით.
                </p>
            </v-card-text>
        </v-card>
    </v-dialog>
</template>

<script>
import DefaultView from "../layouts/default/View.vue";
import { mapActions } from "vuex";

export default {
    components: { DefaultView },
    data() {
        return {
            dialog: false,
            canSee: "",
            confidenceDialog: false,
            order: 0,
            drawer: null,
            user: this.$store.state.auth.user,
            languages: [
                { name: "English", code: "en", flag: "us" },
                { name: "ქართული", code: "ka", flag: "ge" },
                // ... add more languages as necessary
            ],
            selectedLanguage: "ka", // default selected language
        };
    },
};
</script>
<style>
.bg-image {
    background-image: url("../assets/city-building-background-vector.jpg");
    background-repeat: no-repeat;
    background-size: cover; /* Cover the viewport */
    background-attachment: fixed;
    min-height: max-content;
}

.hover {
    cursor: pointer;
}

.hover:hover {
    box-shadow: 0 4px 15px rgba(0, 0, 0, 0.2); /* Horizontal offset, Vertical offset, Blur radius, Spread radius, Color */
}

.beautiful-text {
    background: -webkit-linear-gradient(
        135deg,
        rgba(10, 10, 10, 0.99),
        #a20000ff
    ); /* Color gradient */
    -webkit-background-clip: text; /* Apply gradient to text only */
    color: transparent; /* Make the text color transparent to show the gradient */
    text-shadow: 3px 3px 10px rgba(0, 0, 0, 0.2); /* Text shadow for depth */
    letter-spacing: 1.5px; /* Some spacing between letters */
    font-weight: 700;
}

.f-25 {
    font-size: 25px;
}

.f-35 {
    font-size: 35px;
}

.headerLinks {
    text-decoration: none;
    font-size: 25px !important;
    font-weight: 600 !important;
    color: #ed2a2a !important;
}

.headerLinks2 {
    text-decoration: none;
    font-weight: 600 !important;
    color: #ed2a2a !important;
}

.headerLinksDiv {
}

.headerLinksDiv:hover {
    border-bottom: 2px white solid;
}
</style>
